penn-memo/app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("date", "created_at", "updated_at") VALUES (?, ?, ?)  [["date", Sat, 29 Oct 2016], ["created_at", 2016-10-29 14:34:27 UTC], ["updated_at", 2016-10-29 14:34:27 UTC]]

  def destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]